PinguinoIDE/pinguino-compilers/linux/p8/share/gputils/header/p18f46k80.inc
        LIST

;==========================================================================
;  MPASM PIC18F46K80 processor include
; 
;  (c) Copyright 1999-2013 Microchip Technology, All rights reserved
;==========================================================================

        NOLIST

;==========================================================================
;  This header file defines configurations, registers, and other useful
;  bits of information for the PIC18F46K80 microcontroller.  These names
;  are taken to match the data sheets as closely as possible.
;
;  Note that the processor must be selected before this file is included.
;  The processor may be selected the following ways:
;
;       1. Command line switch:
;               C:\MPASM MYFILE.ASM /PIC18F46K80
;       2. LIST directive in the source file
;               LIST   P=PIC18F46K80
;       3. Processor Type entry in the MPASM full-screen interface
;       4. Setting the processor in the MPLAB Project Dialog
;==========================================================================

;==========================================================================
;
;       Verify Processor
;
;==========================================================================
        IFNDEF __18F46K80
           MESSG "Processor-header file mismatch.  Verify selected processor."
        ENDIF

;==========================================================================
;       18xxxx Family        EQUates
;==========================================================================
FSR0            EQU 0
FSR1            EQU 1
FSR2            EQU 2

FAST            EQU 1

W               EQU 0
A               EQU 0
ACCESS          EQU 0
BANKED          EQU 1
;==========================================================================

;==========================================================================
;       16Cxxx/17Cxxx Substitutions
;==========================================================================
  #define DDRA  TRISA      ; PIC17Cxxx SFR substitution
  #define DDRB  TRISB      ; PIC17Cxxx SFR substitution
  #define DDRC  TRISC      ; PIC17Cxxx SFR substitution
  #define DDRD  TRISD      ; PIC17Cxxx SFR substitution
  #define DDRE  TRISE      ; PIC17Cxxx SFR substitution

;==========================================================================
;
;       Register Definitions
;
;==========================================================================

;----- Register Files -----------------------------------------------------
RXERRCNT         EQU  H'0E41'
TXERRCNT         EQU  H'0E42'
BRGCON1          EQU  H'0E43'
BRGCON2          EQU  H'0E44'
BRGCON3          EQU  H'0E45'
RXFCON0          EQU  H'0E46'
RXFCON1          EQU  H'0E47'
RXF6SIDH         EQU  H'0E48'
RXF6SIDL         EQU  H'0E49'
RXF6EIDH         EQU  H'0E4A'
RXF6EIDL         EQU  H'0E4B'
RXF7SIDH         EQU  H'0E4C'
RXF7SIDL         EQU  H'0E4D'
RXF7EIDH         EQU  H'0E4E'
RXF7EIDL         EQU  H'0E4F'
RXF8SIDH         EQU  H'0E50'
RXF8SIDL         EQU  H'0E51'
RXF8EIDH         EQU  H'0E52'
RXF8EIDL         EQU  H'0E53'
RXF9SIDH         EQU  H'0E54'
RXF9SIDL         EQU  H'0E55'
RXF9EIDH         EQU  H'0E56'
RXF9EIDL         EQU  H'0E57'
RXF10SIDH        EQU  H'0E58'
RXF10SIDL        EQU  H'0E59'
RXF10EIDH        EQU  H'0E5A'
RXF10EIDL        EQU  H'0E5B'
RXF11SIDH        EQU  H'0E5C'
RXF11SIDL        EQU  H'0E5D'
RXF11EIDH        EQU  H'0E5E'
RXF11EIDL        EQU  H'0E5F'
RXF12SIDH        EQU  H'0E60'
RXF12SIDL        EQU  H'0E61'
RXF12EIDH        EQU  H'0E62'
RXF12EIDL        EQU  H'0E63'
RXF13SIDH        EQU  H'0E64'
RXF13SIDL        EQU  H'0E65'
RXF13EIDH        EQU  H'0E66'
RXF13EIDL        EQU  H'0E67'
RXF14SIDH        EQU  H'0E68'
RXF14SIDL        EQU  H'0E69'
RXF14EIDH        EQU  H'0E6A'
RXF14EIDL        EQU  H'0E6B'
RXF15SIDH        EQU  H'0E6C'
RXF15SIDL        EQU  H'0E6D'
RXF15EIDH        EQU  H'0E6E'
RXF15EIDL        EQU  H'0E6F'
SDFLC            EQU  H'0E70'
RXFBCON0         EQU  H'0E71'
RXFBCON1         EQU  H'0E72'
RXFBCON2         EQU  H'0E73'
RXFBCON3         EQU  H'0E74'
RXFBCON4         EQU  H'0E75'
RXFBCON5         EQU  H'0E76'
RXFBCON6         EQU  H'0E77'
RXFBCON7         EQU  H'0E78'
MSEL0            EQU  H'0E79'
MSEL1            EQU  H'0E7A'
MSEL2            EQU  H'0E7B'
MSEL3            EQU  H'0E7C'
BSEL0            EQU  H'0E7D'
BIE0             EQU  H'0E7E'
TXBIE            EQU  H'0E7F'
B0CON            EQU  H'0E80'
B0SIDH           EQU  H'0E81'
B0SIDL           EQU  H'0E82'
B0EIDH           EQU  H'0E83'
B0EIDL           EQU  H'0E84'
B0DLC            EQU  H'0E85'
B0D0             EQU  H'0E86'
B0D1             EQU  H'0E87'
B0D2             EQU  H'0E88'
B0D3             EQU  H'0E89'
B0D4             EQU  H'0E8A'
B0D5             EQU  H'0E8B'
B0D6             EQU  H'0E8C'
B0D7             EQU  H'0E8D'
CANSTAT_RO9      EQU  H'0E8E'
CANCON_RO9       EQU  H'0E8F'
B1CON            EQU  H'0E90'
B1SIDH           EQU  H'0E91'
B1SIDL           EQU  H'0E92'
B1EIDH           EQU  H'0E93'
B1EIDL           EQU  H'0E94'
B1DLC            EQU  H'0E95'
B1D0             EQU  H'0E96'
B1D1             EQU  H'0E97'
B1D2             EQU  H'0E98'
B1D3             EQU  H'0E99'
B1D4             EQU  H'0E9A'
B1D5             EQU  H'0E9B'
B1D6             EQU  H'0E9C'
B1D7             EQU  H'0E9D'
CANSTAT_RO8      EQU  H'0E9E'
CANCON_RO8       EQU  H'0E9F'
B2CON            EQU  H'0EA0'
B2SIDH           EQU  H'0EA1'
B2SIDL           EQU  H'0EA2'
B2EIDH           EQU  H'0EA3'
B2EIDL           EQU  H'0EA4'
B2DLC            EQU  H'0EA5'
B2D0             EQU  H'0EA6'
B2D1             EQU  H'0EA7'
B2D2             EQU  H'0EA8'
B2D3             EQU  H'0EA9'
B2D4             EQU  H'0EAA'
B2D5             EQU  H'0EAB'
B2D6             EQU  H'0EAC'
B2D7             EQU  H'0EAD'
CANSTAT_RO7      EQU  H'0EAE'
CANCON_RO7       EQU  H'0EAF'
B3CON            EQU  H'0EB0'
B3SIDH           EQU  H'0EB1'
B3SIDL           EQU  H'0EB2'
B3EIDH           EQU  H'0EB3'
B3EIDL           EQU  H'0EB4'
B3DLC            EQU  H'0EB5'
B3D0             EQU  H'0EB6'
B3D1             EQU  H'0EB7'
B3D2             EQU  H'0EB8'
B3D3             EQU  H'0EB9'
B3D4             EQU  H'0EBA'
B3D5             EQU  H'0EBB'
B3D6             EQU  H'0EBC'
B3D7             EQU  H'0EBD'
CANSTAT_RO6      EQU  H'0EBE'
CANCON_RO6       EQU  H'0EBF'
B4CON            EQU  H'0EC0'
B4SIDH           EQU  H'0EC1'
B4SIDL           EQU  H'0EC2'
B4EIDH           EQU  H'0EC3'
B4EIDL           EQU  H'0EC4'
B4DLC            EQU  H'0EC5'
B4D0             EQU  H'0EC6'
B4D1             EQU  H'0EC7'
B4D2             EQU  H'0EC8'
B4D3             EQU  H'0EC9'
B4D4             EQU  H'0ECA'
B4D5             EQU  H'0ECB'
B4D6             EQU  H'0ECC'
B4D7             EQU  H'0ECD'
CANSTAT_RO5      EQU  H'0ECE'
CANCON_RO5       EQU  H'0ECF'
B5CON            EQU  H'0ED0'
B5SIDH           EQU  H'0ED1'
B5SIDL           EQU  H'0ED2'
B5EIDH           EQU  H'0ED3'
B5EIDL           EQU  H'0ED4'
B5DLC            EQU  H'0ED5'
B5D0             EQU  H'0ED6'
B5D1             EQU  H'0ED7'
B5D2             EQU  H'0ED8'
B5D3             EQU  H'0ED9'
B5D4             EQU  H'0EDA'
B5D5             EQU  H'0EDB'
B5D6             EQU  H'0EDC'
B5D7             EQU  H'0EDD'
CANSTAT_RO4      EQU  H'0EDE'
CANCON_RO4       EQU  H'0EDF'
RXF0SIDH         EQU  H'0EE0'
RXF0SIDL         EQU  H'0EE1'
RXF0EIDH         EQU  H'0EE2'
RXF0EIDL         EQU  H'0EE3'
RXF1SIDH         EQU  H'0EE4'
RXF1SIDL         EQU  H'0EE5'
RXF1EIDH         EQU  H'0EE6'
RXF1EIDL         EQU  H'0EE7'
RXF2SIDH         EQU  H'0EE8'
RXF2SIDL         EQU  H'0EE9'
RXF2EIDH         EQU  H'0EEA'
RXF2EIDL         EQU  H'0EEB'
RXF3SIDH         EQU  H'0EEC'
RXF3SIDL         EQU  H'0EED'
RXF3EIDH         EQU  H'0EEE'
RXF3EIDL         EQU  H'0EEF'
RXF4SIDH         EQU  H'0EF0'
RXF4SIDL         EQU  H'0EF1'
RXF4EIDH         EQU  H'0EF2'
RXF4EIDL         EQU  H'0EF3'
RXF5SIDH         EQU  H'0EF4'
RXF5SIDL         EQU  H'0EF5'
RXF5EIDH         EQU  H'0EF6'
RXF5EIDL         EQU  H'0EF7'
RXM0SIDH         EQU  H'0EF8'
RXM0SIDL         EQU  H'0EF9'
RXM0EIDH         EQU  H'0EFA'
RXM0EIDL         EQU  H'0EFB'
RXM1SIDH         EQU  H'0EFC'
RXM1SIDL         EQU  H'0EFD'
RXM1EIDH         EQU  H'0EFE'
RXM1EIDL         EQU  H'0EFF'
TXB2CON          EQU  H'0F00'
TXB2SIDH         EQU  H'0F01'
TXB2SIDL         EQU  H'0F02'
TXB2EIDH         EQU  H'0F03'
TXB2EIDL         EQU  H'0F04'
TXB2DLC          EQU  H'0F05'
TXB2D0           EQU  H'0F06'
TXB2D1           EQU  H'0F07'
TXB2D2           EQU  H'0F08'
TXB2D3           EQU  H'0F09'
TXB2D4           EQU  H'0F0A'
TXB2D5           EQU  H'0F0B'
TXB2D6           EQU  H'0F0C'
TXB2D7           EQU  H'0F0D'
CANSTAT_RO3      EQU  H'0F0E'
CANCON_RO3       EQU  H'0F0F'
TXB1CON          EQU  H'0F10'
TXB1SIDH         EQU  H'0F11'
TXB1SIDL         EQU  H'0F12'
TXB1EIDH         EQU  H'0F13'
TXB1EIDL         EQU  H'0F14'
TXB1DLC          EQU  H'0F15'
TXB1D0           EQU  H'0F16'
TXB1D1           EQU  H'0F17'
TXB1D2           EQU  H'0F18'
TXB1D3           EQU  H'0F19'
TXB1D4           EQU  H'0F1A'
TXB1D5           EQU  H'0F1B'
TXB1D6           EQU  H'0F1C'
TXB1D7           EQU  H'0F1D'
CANSTAT_RO2      EQU  H'0F1E'
CANCON_RO2       EQU  H'0F1F'
TXB0CON          EQU  H'0F20'
TXB0SIDH         EQU  H'0F21'
TXB0SIDL         EQU  H'0F22'
TXB0EIDH         EQU  H'0F23'
TXB0EIDL         EQU  H'0F24'
TXB0DLC          EQU  H'0F25'
TXB0D0           EQU  H'0F26'
TXB0D1           EQU  H'0F27'
TXB0D2           EQU  H'0F28'
TXB0D3           EQU  H'0F29'
TXB0D4           EQU  H'0F2A'
TXB0D5           EQU  H'0F2B'
TXB0D6           EQU  H'0F2C'
TXB0D7           EQU  H'0F2D'
CANSTAT_RO1      EQU  H'0F2E'
CANCON_RO1       EQU  H'0F2F'
RXB1CON          EQU  H'0F30'
RXB1SIDH         EQU  H'0F31'
RXB1SIDL         EQU  H'0F32'
RXB1EIDH         EQU  H'0F33'
RXB1EIDL         EQU  H'0F34'
RXB1DLC          EQU  H'0F35'
RXB1D0           EQU  H'0F36'
RXB1D1           EQU  H'0F37'
RXB1D2           EQU  H'0F38'
RXB1D3           EQU  H'0F39'
RXB1D4           EQU  H'0F3A'
RXB1D5           EQU  H'0F3B'
RXB1D6           EQU  H'0F3C'
RXB1D7           EQU  H'0F3D'
CANSTAT_RO0      EQU  H'0F3E'
CANCON_RO0       EQU  H'0F3F'
PSPCON           EQU  H'0F46'
CCP5CON          EQU  H'0F47'
CCPR5            EQU  H'0F48'
CCPR5L           EQU  H'0F48'
CCPR5H           EQU  H'0F49'
CCP4CON          EQU  H'0F4A'
CCPR4            EQU  H'0F4B'
CCPR4L           EQU  H'0F4B'
CCPR4H           EQU  H'0F4C'
CCP3CON          EQU  H'0F4D'
CCPR3            EQU  H'0F4E'
CCPR3L           EQU  H'0F4E'
CCPR3H           EQU  H'0F4F'
CCP2CON          EQU  H'0F50'
ECCP2CON         EQU  H'0F50'
CCPR2            EQU  H'0F51'
CCPR2L           EQU  H'0F51'
CCPR2H           EQU  H'0F52'
CTMUICON         EQU  H'0F53'
CTMUCONL         EQU  H'0F54'
CTMUCONH         EQU  H'0F55'
PADCFG1          EQU  H'0F56'
PMD2             EQU  H'0F57'
PMD1             EQU  H'0F58'
PMD0             EQU  H'0F59'
IOCB             EQU  H'0F5A'
WPUB             EQU  H'0F5B'
ANCON1           EQU  H'0F5C'
ANCON0           EQU  H'0F5D'
CM2CON           EQU  H'0F5E'
CM2CON1          EQU  H'0F5E'
CM1CON           EQU  H'0F5F'
CM1CON1          EQU  H'0F5F'
RXB0CON          EQU  H'0F60'
RXB0SIDH         EQU  H'0F61'
RXB0SIDL         EQU  H'0F62'
RXB0EIDH         EQU  H'0F63'
RXB0EIDL         EQU  H'0F64'
RXB0DLC          EQU  H'0F65'
RXB0D0           EQU  H'0F66'
RXB0D1           EQU  H'0F67'
RXB0D2           EQU  H'0F68'
RXB0D3           EQU  H'0F69'
RXB0D4           EQU  H'0F6A'
RXB0D5           EQU  H'0F6B'
RXB0D6           EQU  H'0F6C'
RXB0D7           EQU  H'0F6D'
CANSTAT          EQU  H'0F6E'
CANCON           EQU  H'0F6F'
CIOCON           EQU  H'0F70'
COMSTAT          EQU  H'0F71'
ECANCON          EQU  H'0F72'
EEDATA           EQU  H'0F73'
EEADR            EQU  H'0F74'
EEADRH           EQU  H'0F75'
PIE5             EQU  H'0F76'
PIR5             EQU  H'0F77'
IPR5             EQU  H'0F78'
TXREG2           EQU  H'0F79'
RCREG2           EQU  H'0F7A'
SPBRG2           EQU  H'0F7B'
SPBRGH2          EQU  H'0F7C'
SPBRGH1          EQU  H'0F7D'
EECON2           EQU  H'0F7E'
EECON1           EQU  H'0F7F'
PORTA            EQU  H'0F80'
PORTB            EQU  H'0F81'
PORTC            EQU  H'0F82'
PORTD            EQU  H'0F83'
PORTE            EQU  H'0F84'
TMR4             EQU  H'0F87'
T4CON            EQU  H'0F88'
LATA             EQU  H'0F89'
LATB             EQU  H'0F8A'
LATC             EQU  H'0F8B'
LATD             EQU  H'0F8C'
LATE             EQU  H'0F8D'
SLRCON           EQU  H'0F90'
ODCON            EQU  H'0F91'
TRISA            EQU  H'0F92'
TRISB            EQU  H'0F93'
TRISC            EQU  H'0F94'
TRISD            EQU  H'0F95'
TRISE            EQU  H'0F96'
CCPTMRS          EQU  H'0F99'
REFOCON          EQU  H'0F9A'
OSCTUNE          EQU  H'0F9B'
PSTR1CON         EQU  H'0F9C'
PIE1             EQU  H'0F9D'
PIR1             EQU  H'0F9E'
IPR1             EQU  H'0F9F'
PIE2             EQU  H'0FA0'
PIR2             EQU  H'0FA1'
IPR2             EQU  H'0FA2'
PIE3             EQU  H'0FA3'
PIR3             EQU  H'0FA4'
IPR3             EQU  H'0FA5'
RCSTA2           EQU  H'0FA6'
BAUDCON1         EQU  H'0FA7'
HLVDCON          EQU  H'0FA8'
PR4              EQU  H'0FA9'
T1GCON           EQU  H'0FAA'
RCSTA            EQU  H'0FAB'
RCSTA1           EQU  H'0FAB'
TXSTA            EQU  H'0FAC'
TXSTA1           EQU  H'0FAC'
TXREG            EQU  H'0FAD'
TXREG1           EQU  H'0FAD'
RCREG            EQU  H'0FAE'
RCREG1           EQU  H'0FAE'
SPBRG            EQU  H'0FAF'
SPBRG1           EQU  H'0FAF'
T3GCON           EQU  H'0FB0'
T3CON            EQU  H'0FB1'
TMR3             EQU  H'0FB2'
TMR3L            EQU  H'0FB2'
TMR3H            EQU  H'0FB3'
CMSTAT           EQU  H'0FB4'
CMSTATUS         EQU  H'0FB4'
CVRCON           EQU  H'0FB5'
PIE4             EQU  H'0FB6'
PIR4             EQU  H'0FB7'
IPR4             EQU  H'0FB8'
BAUDCON2         EQU  H'0FB9'
TXSTA2           EQU  H'0FBA'
CCP1CON          EQU  H'0FBB'
ECCP1CON         EQU  H'0FBB'
CCPR1            EQU  H'0FBC'
CCPR1L           EQU  H'0FBC'
CCPR1H           EQU  H'0FBD'
ECCP1DEL         EQU  H'0FBE'
PWM1CON          EQU  H'0FBE'
ECCP1AS          EQU  H'0FBF'
ADCON2           EQU  H'0FC0'
ADCON1           EQU  H'0FC1'
ADCON0           EQU  H'0FC2'
ADRES            EQU  H'0FC3'
ADRESL           EQU  H'0FC3'
ADRESH           EQU  H'0FC4'
SSPCON2          EQU  H'0FC5'
SSPCON1          EQU  H'0FC6'
SSPSTAT          EQU  H'0FC7'
SSPADD           EQU  H'0FC8'
SSPBUF           EQU  H'0FC9'
T2CON            EQU  H'0FCA'
PR2              EQU  H'0FCB'
TMR2             EQU  H'0FCC'
T1CON            EQU  H'0FCD'
TMR1             EQU  H'0FCE'
TMR1L            EQU  H'0FCE'
TMR1H            EQU  H'0FCF'
RCON             EQU  H'0FD0'
WDTCON           EQU  H'0FD1'
OSCCON2          EQU  H'0FD2'
OSCCON           EQU  H'0FD3'
T0CON            EQU  H'0FD5'
TMR0             EQU  H'0FD6'
TMR0L            EQU  H'0FD6'
TMR0H            EQU  H'0FD7'
STATUS           EQU  H'0FD8'
FSR2L            EQU  H'0FD9'
FSR2H            EQU  H'0FDA'
PLUSW2           EQU  H'0FDB'
PREINC2          EQU  H'0FDC'
POSTDEC2         EQU  H'0FDD'
POSTINC2         EQU  H'0FDE'
INDF2            EQU  H'0FDF'
BSR              EQU  H'0FE0'
FSR1L            EQU  H'0FE1'
FSR1H            EQU  H'0FE2'
PLUSW1           EQU  H'0FE3'
PREINC1          EQU  H'0FE4'
POSTDEC1         EQU  H'0FE5'
POSTINC1         EQU  H'0FE6'
INDF1            EQU  H'0FE7'
WREG             EQU  H'0FE8'
FSR0L            EQU  H'0FE9'
FSR0H            EQU  H'0FEA'
PLUSW0           EQU  H'0FEB'
PREINC0          EQU  H'0FEC'
POSTDEC0         EQU  H'0FED'
POSTINC0         EQU  H'0FEE'
INDF0            EQU  H'0FEF'
INTCON3          EQU  H'0FF0'
INTCON2          EQU  H'0FF1'
INTCON           EQU  H'0FF2'
INTCON1          EQU  H'0FF2'
PROD             EQU  H'0FF3'
PRODL            EQU  H'0FF3'
PRODH            EQU  H'0FF4'
TABLAT           EQU  H'0FF5'
TBLPTR           EQU  H'0FF6'
TBLPTRL          EQU  H'0FF6'
TBLPTRH          EQU  H'0FF7'
TBLPTRU          EQU  H'0FF8'
PC               EQU  H'0FF9'
PCL              EQU  H'0FF9'
PCLATH           EQU  H'0FFA'
PCLATU           EQU  H'0FFB'
STKPTR           EQU  H'0FFC'
TOS              EQU  H'0FFD'
TOSL             EQU  H'0FFD'
TOSH             EQU  H'0FFE'
TOSU             EQU  H'0FFF'

;----- RXERRCNT Bits -----------------------------------------------------
REC0             EQU  H'0000'
REC1             EQU  H'0001'
REC2             EQU  H'0002'
REC3             EQU  H'0003'
REC4             EQU  H'0004'
REC5             EQU  H'0005'
REC6             EQU  H'0006'
REC7             EQU  H'0007'


;----- TXERRCNT Bits -----------------------------------------------------
TEC0             EQU  H'0000'
TEC1             EQU  H'0001'
TEC2             EQU  H'0002'
TEC3             EQU  H'0003'
TEC4             EQU  H'0004'
TEC5             EQU  H'0005'
TEC6             EQU  H'0006'
TEC7             EQU  H'0007'


;----- BRGCON1 Bits -----------------------------------------------------
BRP0             EQU  H'0000'
BRP1             EQU  H'0001'
BRP2             EQU  H'0002'
BRP3             EQU  H'0003'
BRP4             EQU  H'0004'
BRP5             EQU  H'0005'
SJW0             EQU  H'0006'
SJW1             EQU  H'0007'


;----- BRGCON2 Bits -----------------------------------------------------
SAM              EQU  H'0006'
SEG2PHTS         EQU  H'0007'

PRSEG0           EQU  H'0000'
PRSEG1           EQU  H'0001'
PRSEG2           EQU  H'0002'
SEG1PH0          EQU  H'0003'
SEG1PH1          EQU  H'0004'
SEG1PH2          EQU  H'0005'


;----- BRGCON3 Bits -----------------------------------------------------
WAKFIL           EQU  H'0006'
WAKDIS           EQU  H'0007'

SEG2PH0          EQU  H'0000'
SEG2PH1          EQU  H'0001'
SEG2PH2          EQU  H'0002'


;----- RXFCON0 Bits -----------------------------------------------------
RXF0EN           EQU  H'0000'
RXF1EN           EQU  H'0001'
RXF2EN           EQU  H'0002'
RXF3EN           EQU  H'0003'
RXF4EN           EQU  H'0004'
RXF5EN           EQU  H'0005'
RXF6EN           EQU  H'0006'
RXF7EN           EQU  H'0007'


;----- RXFCON1 Bits -----------------------------------------------------
RXF8EN           EQU  H'0000'
RXF9EN           EQU  H'0001'
RXF10EN          EQU  H'0002'
RXF11EN          EQU  H'0003'
RXF12EN          EQU  H'0004'
RXF13EN          EQU  H'0005'
RXF14EN          EQU  H'0006'
RXF15EN          EQU  H'0007'


;----- RXF6SIDH Bits -----------------------------------------------------
SID3             EQU  H'0000'
SID4             EQU  H'0001'
SID5             EQU  H'0002'
SID6             EQU  H'0003'
SID7             EQU  H'0004'
SID8             EQU  H'0005'
SID9             EQU  H'0006'
SID10            EQU  H'0007'


;----- RXF6SIDL Bits -----------------------------------------------------
EXIDEN           EQU  H'0003'

EID16            EQU  H'0000'
EID17            EQU  H'0001'
SID0             EQU  H'0005'
SID1             EQU  H'0006'
SID2             EQU  H'0007'


;----- RXF6EIDH Bits -----------------------------------------------------
EID8             EQU  H'0000'
EID9             EQU  H'0001'
EID10            EQU  H'0002'
EID11            EQU  H'0003'
EID12            EQU  H'0004'
EID13            EQU  H'0005'
EID14            EQU  H'0006'
EID15            EQU  H'0007'


;----- RXF6EIDL Bits -----------------------------------------------------
EID0             EQU  H'0000'
EID1             EQU  H'0001'
EID2             EQU  H'0002'
EID3             EQU  H'0003'
EID4             EQU  H'0004'
EID5             EQU  H'0005'
EID6             EQU  H'0006'
EID7             EQU  H'0007'


